rottenpotatoes/app/controllers/movies_controller.rb

  def search_director
    if params[:director] != nil and params[:director] != ''
      @director = params[:director]
      @movies = Movie.where(director: params[:director])
---
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]